package ging

import (
	"github.com/gin-gonic/gin"
)

/* ================================================================================
 * Filter
 * qq group: 582452342
 * email   : 2091938785@qq.com
 * author  : 美丽的地球啊 - mliu
 * ================================================================================ */

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 * action filter interface
 * ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
type (
	IActionFilterList []IActionFilter

	IActionFilter interface {
		Before(*gin.Context) IActionResult
		After(*gin.Context)
	}
)

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 * filter data struct
 * ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
type Filter struct {
	Name string
}
