package result

import (
	"github.com/gin-gonic/gin"
)

/* ================================================================================
 * Redirect结果
 * author: 美丽的地球啊
 * ================================================================================ */

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 * Redirect视图结果数据结构
 * ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
type (
	redirectResult struct {
		ActionResult
		url string
	}
)

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 * Redirect视图结果
 * ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
func RedirectResult(context *gin.Context, args ...string) IActionResult {
	redirectUrl := "/"
	if len(args) > 0 {
		redirectUrl = args[0]
	}

	result := &redirectResult{
		url: redirectUrl,
	}

	result.context = context
	return result
}

/* ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
 * 渲染
 * ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ */
func (r *redirectResult) Render() {
	r.Redirect(r.url)
}
